<?php
/**
 * 返回状态码
 * User: zhangying
 * Date: 2018/11/7
 * Time: 下午10:15
 */
return [
    'code' => [
        200 => '成功',
        204 => '获取数据失败',
        200001 => '缺少必要的参数',

        //文章
        503001 => '上传文件的格式不正确',
        503002 => '同步成功-记录保存失败',
        503003 => '权限错误',
        503004 => '文章保存失败',
        403017 => '临近定时时间不能取消发送任务',
        403018 => '临近定时时间不能修改发送任务',
        403019 => '超过发送时间不能发送',
        403020 => '缺少发表记录ID参数',
        //SMS
        416001 => '添加成功,审核中,请耐心等待',
        416002 => '签名添加失败',
    ],

];